Phpigni/app/Controllers/AuthController.php

    public function registerPsi()
    //register-psi para inserir dados dos psicologos
    {
        // Recebe os dados do Flutter
        $data = $this->request->getJSON(true);

        // Valida os dados (opcional)
        if (empty($data['uid']) || empty($data['email'])) {
            return $this->failValidationErrors('Dados inválidos.');
        }
        $data['data'] = date('Y-m-d', strtotime($data['data']));


        $model = new Psicologos();
        $model->save([
            'uid'   => $data['uid'],
            'email' => $data['email'],
            'apelido'=> $data['apelido'],
            'crp'   => $data['crp'],
            'nome'  => $data['nome'],
            'telefone' => $data['telefone'],
            'data'  => $data['data'],
            'sexo'  => $data['sexo'],
        ]);
---
INSERT INTO `Psicologos` (`uid`, `email`, `apelido`, `crp`, `nome`, `telefone`, `data`, `sexo`, `created_at`, `updated_at`) VALUES ('67090', 'user@example.com', 'common_user', '909090', 'Maria José', '11912345678', '1999-09-10', 'Feminino', '2025-03-08 15:00:25', '2025-03-08 15:00:25')

    public function registerUser()
{
    $data = $this->request->getJSON(true);

    if (empty($data['uid']) || empty($data['email'])) {
        return $this->failValidationErrors('Dados inválidos.');
    }

    $model = new Usuarios();

    // Hash da senha
    $hashedPassword = password_hash($data['password'], PASSWORD_BCRYPT);

    $model->save([
        'uid' => $data['uid'],
        'email' => $data['email'],
        'password_hash' => $hashedPassword,
        'apelido' => $data['apelido'] ?? '',
        'nome' => $data['nome'] ?? '',
        'telefone' => $data['telefone'] ?? '',
        'data' => $data['data'] ?? null,
        'sexo' => $data['sexo'] ?? '',
    ]);
---
INSERT INTO `usuarios` (`uid`, `email`, `password_hash`, `apelido`, `nome`, `telefone`, `data`, `sexo`, `created_at`, `updated_at`) VALUES ('YUwhoGb2BTe0dOgIXm1FoNKaIFd2', 'teste@teste.com', '$2y$10$MIEckGsY0GcAdcvLl5zQ3.dswNKTnKnbQEPk3sGoManBLhWVoH15C', 'testinho', 'testando', '1140028922', '2025-03-01', 'Feminino', '2025-03-25 18:19:24', '2025-03-25 18:19:24')

    public function updatePsi()
    {
        // Recebe os dados do Flutter
        $data = $this->request->getJSON(true);

        // Valida os dados (opcional)
        if (empty($data['uid'])) {
            return $this->failValidationErrors('UID é obrigatório.');
        }

        // Busca o psicólogo pelo UID
        $model = new Psicologos();
        $psi = $model->where('uid', $data['uid'])->first();

        if (!$psi) {
            return $this->failNotFound('Psicólogo não encontrado.');
        }

        // Atualiza os dados
        $model->update($psi['id'], [
            'Email'    => $data['email'] ?? $psi['email'],
            'apelido' => $data['apelido'] ?? $psi['apelido'],
            'crp'     => $data['crp'] ?? $psi['crp'],
            'nome'    => $data['nome'] ?? $psi['nome'],
            'telefone' => $data['telefone'] ?? $psi['telefone'],
            'data'    => !empty($data['data']) ? date('Y-m-d', strtotime($data['data'])) : $psi['data'],
            'sexo'    => $data['sexo'] ?? $psi['sexo'],
        ]);
---
SELECT *
FROM `psicologos`
WHERE `uid` = '12345'
 LIMIT 1
UPDATE `psicologos` SET `email` = 'novo_email@example.com', `apelido` = 'psi_nick', `crp` = '123456', `nome` = 'João Silva', `telefone` = '11977777777', `data` = '1990-01-01', `sexo` = 'Masculino', `updated_at` = '2025-03-13 17:51:25'
WHERE `psicologos`.`id` IN ('9')

    public function updateUser()
    {

        // Recebe os dados do Flutter
        $data = $this->request->getJSON(true);

        // Valida os dados
        if (empty($data['uid'])) {
            log_message('error', 'UID não fornecido');
            return $this->failValidationErrors('UID é obrigatório.');
        }

        // Busca o usuário pelo UID
        $model = new Usuarios();
        $user = $model->where('uid', $data['uid'])->first();
---
SELECT *
FROM `usuarios`
WHERE `uid` = 'YUwhoGb2BTe0dOgIXm1FoNKaIFd2'
 LIMIT 1

    public function checkPsi()
    {
        // Recebe os dados do Flutter
        $data = $this->request->getJSON(true);

        // Valida os dados (opcional)
        if (empty($data['uid']) && empty($data['email'])) {
            return $this->failValidationErrors('UID ou email é obrigatório.');
        }

        // Busca o psicólogo pelo UID ou email
        $model = new Psicologos();
        $psi = $model->where('uid', $data['uid'])->orWhere('email', $data['email'])->first();
---
SELECT *
FROM `psicologos`
WHERE `uid` = ''
OR `email` = 'psiteste2@teste.com'
 LIMIT 1

    public function checkUser()
    {
        // Recebe os dados do Flutter
        $data = $this->request->getJSON(true);

        // Valida os dados (opcional)
        if (empty($data['uid']) && empty($data['email'])) {
            return $this->failValidationErrors('UID ou email é obrigatório.');
        }

        // Busca o usuário pelo UID ou email
        $model = new Usuarios();
        $user = $model->where('uid', $data['uid'])->orWhere('email', $data['email'])->first();
---
SELECT *
FROM `usuarios`
WHERE `uid` = ''
OR `email` = 'teste@teste.com'
 LIMIT 1

public function deleteUser()
{
    // Recebe os dados do Flutter
    $data = $this->request->getJSON(true);

    // Valida os dados
    if (empty($data['uid'])) {
        return $this->failValidationErrors('UID é obrigatório.');
    }

    // Busca e exclui o usuário
    $model = new Usuarios();
    $user = $model->where('uid', $data['uid'])->first();

    if (!$user) {
        return $this->failNotFound('Usuário não encontrado.');
    }

    $model->delete($user['id']);
---
SELECT *
FROM `usuarios`
WHERE `uid` = 'QdqWX0yV1DgiwBRJOTgN9s7JdCE2'
 LIMIT 1
DELETE FROM `usuarios`
WHERE `id` IN ('10')

public function updatePassword()
{
    $data = $this->request->getJSON(true);

    // Validação
    if (empty($data['uid']) || empty($data['new_password'])) {
        return $this->failValidationErrors('Dados inválidos.');
    }

    $model = new Usuarios();
    $user = $model->where('uid', $data['uid'])->first();

    if (!$user) {
        return $this->failNotFound('Usuário não encontrado.');
    }

    // Atualiza a senha com hash seguro
    $hashedPassword = password_hash($data['new_password'], PASSWORD_BCRYPT);

    $model->update($user['id'], [
        'password_hash' => $hashedPassword
    ]);
---
SELECT *
FROM `usuarios`
WHERE `uid` = 'zhtS8XmNPdhDi8jJqRUV3yTs7C43'
 LIMIT 1
UPDATE `usuarios` SET `password_hash` = '$2y$10$ZgvdyZ8QIIk66E2H0MPpqOgt4HRZOLvzjEYmePrYkkbLKdQtEUXd2', `updated_at` = '2025-03-25 19:08:16'
WHERE `usuarios`.`id` IN ('15')