Phpigni/app/Controllers/DiarioController.php

    public function salvarAnotacao()
    {

        $data = $this->request->getJSON(true);


        if (empty($data['usuario_uid']) || empty($data['titulo']) || empty($data['conteudo'])) {
            return $this->failValidationErrors('Dados inválidos.');
        }


        $model = new AnotacoesModel();
        $model->save([
            'usuario_uid' => $data['usuario_uid'],
            'titulo' => $data['titulo'],
            'conteudo' => $data['conteudo'],
            'compartilhada' => false,
        ]);
---
INSERT INTO `anotacoes` (`usuario_uid`, `titulo`, `conteudo`, `compartilhada`, `data`, `updated_at`) VALUES ('V0Jt8RdVONbd6FnEVxwob3Z45nE3', 'Minha primeira anotação', 'Hoje foi um dia produtivo!', 0, '2025-03-12 15:19:39', '2025-03-12 15:19:39')

    public function listarAnotacoes($usuario_uid)
    {
        $model = new AnotacoesModel();
        $anotacoes = $model->where('usuario_uid', $usuario_uid)->findAll();
---
SELECT *
FROM `anotacoes`
WHERE `usuario_uid` = 'V0Jt8RdVONbd6FnEVxwob3Z45nE3'